{
  "meals": [
    {
      "idMeal": "52771",
      "strMeal": "Spicy Arrabiata Penne",
      "strCategory": "Vegetarian",
      "strArea": "Italian",
      "strInstructions": "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes.\r\nIn a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. Remove from the heat and add the chopped basil.\r\nDrain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg",
      "strTags": "Pasta,Curry",
      "strYoutube": "https://www.youtube.com/watch?v=1IszT_guI08",
      "id": "320a",
      "mealPreparationTime": "30 minutes",
      "date": "2023-07-31",
      "isFavorited": true,
      "userFeedback": []
    },
    {
      "id": "75fd",
      "idMeal": "52989",
      "strMeal": "Christmas Pudding Trifle",
      "strCategory": "Dessert",
      "strArea": "British",
      "strInstructions": "Peel the oranges using a sharp knife, ensuring all the pith is removed. Slice as thinly as possible and arrange over a dinner plate. Sprinkle with the demerara sugar followed by the Grand Marnier and set aside.\r\n\r\nCrumble the Christmas pudding into large pieces and scatter over the bottom of a trifle bowl. Lift the oranges onto the pudding in a layer and pour over any juices.\r\n\r\nBeat the mascarpone until smooth, then stir in the custard. Spoon the mixture over the top of the oranges.\r\n\r\nLightly whip the cream and spoon over the custard. Sprinkle with the flaked almonds and grated chocolate. You can make this a day in advance if you like, chill until ready to serve.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/r33cud1576791081.jpg",
      "strTags": "Christmas",
      "strYoutube": "https://www.youtube.com/watch?v=jRfyNQs5qhU",
      "mealPreparationTime": "45 minutes",
      "date": "2024-01-19",
      "isFavorited": false,
      "userFeedback": [
        {
          "name": "Brian",
          "rating": 4,
          "comment": "Delicious!"
        }
      ]
    },
    {
      "id": "e7b2",
      "idMeal": "52860",
      "strMeal": "Chocolate Raspberry Brownies",
      "strCategory": "Dessert",
      "strArea": "American",
      "strInstructions": "Heat oven to 180C/160C fan/gas 4. Line a 20 x 30cm baking tray tin with baking parchment. Put the chocolate, butter and sugar in a pan and gently melt, stirring occasionally with a wooden spoon. Remove from the heat.\r\nStir the eggs, one by one, into the melted chocolate mixture. Sieve over the flour and cocoa, and stir in. Stir in half the raspberries, scrape into the tray, then scatter over the remaining raspberries. Bake on the middle shelf for 30 mins or, if you prefer a firmer texture, for 5 mins more. Cool before slicing into squares. Store in an airtight container for up to 3 days.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/yypvst1511386427.jpg",
      "strTags": "Chocolate,Desert,Snack",
      "strYoutube": "https://www.youtube.com/watch?v=Pi89PqsAaAg",
      "mealPreparationTime": "50 minutes",
      "date": "2023-12-15",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "c626",
      "idMeal": "52996",
      "strMeal": "French Onion Chicken with Roasted Carrots & Mashed Potatoes",
      "strCategory": "Chicken",
      "strArea": "American",
      "strInstructions": "1\r\n\r\nPreheat oven to 425 degrees. Wash and dry all produce. Trim, peel, and cut carrots on a diagonal into ¼-inch-thick pieces. Dice potatoes into ½-inch pieces. Halve, peel, and thinly slice onion.\r\n\r\n2\r\n\r\nToss carrots on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 15-20 minutes.\r\n\r\n3\r\n\r\nMeanwhile, place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until tender, 12-15 minutes. Drain and return potatoes to pot; cover to keep warm.\r\n\r\n4\r\n\r\nWhile potatoes cook, heat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring occasionally, until lightly browned and softened, 8-10 minutes. Sprinkle with 1 tsp sugar (2 tsp for 4 servings). Stir in stock concentrate and 2 TBSP water (¼ cup for 4); season with salt and pepper. Cook until jammy, 2-3 minutes more. Turn off heat; transfer to a small bowl. Wash out pan.\r\n\r\n5\r\n\r\nPat chicken dry with paper towels; season all over with salt and pepper. Heat a drizzle of oil in pan used for onion over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. In the last 1-2 minutes of cooking, top with caramelized onion and cheese. Cover pan until cheese melts. (If your pan doesn’t have a lid, cover with a baking sheet!)\r\n\r\n6\r\n\r\nHeat pot with drained potatoes over low heat; mash with sour cream, 2 TBSP butter (4 TBSP for 4 servings), salt, pepper, and a splash of water (or milk, for extra richness) until smooth. Divide chicken, roasted carrots, and mashed potatoes between plates.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/b5ft861583188991.jpg",
      "strTags": null,
      "strYoutube": "",
      "mealPreparationTime": "1 hour",
      "date": "2023-10-21",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "6c21",
      "idMeal": "53049",
      "strMeal": "Apam balik",
      "strCategory": "Dessert",
      "strArea": "Malaysian",
      "strInstructions": "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\r\n\r\nSpread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\r\n\r\nAdd butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\r\n\r\nCut into wedges and best eaten when it is warm.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=6R8ffRRJcrg",
      "mealPreparationTime": "35 minutes",
      "date": "2023-08-06",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "e59b",
      "idMeal": "52840",
      "strMeal": "Clam chowder",
      "strCategory": "Starter",
      "strArea": "American",
      "strInstructions": "Rinse the clams in several changes of cold water and drain well. Tip the clams into a large pan with 500ml of water. Cover, bring to the boil and simmer for 2 mins until the clams have just opened. Tip the contents of the pan into a colander over a bowl to catch the clam stock. When cool enough to handle, remove the clams from their shells – reserving a handful of empty shells for presentation if you want. Strain the clam stock into a jug, leaving any grit in the bottom of the bowl. You should have around 800ml stock.\r\nHeat the butter in the same pan and sizzle the bacon for 3-4 mins until it starts to brown. Stir in the onion, thyme and bay and cook everything gently for 10 mins until the onion is soft and golden. Scatter over the flour and stir in to make a sandy paste, cook for 2 mins more, then gradually stir in the clam stock then the milk and the cream.\r\nThrow in the potatoes, bring everything to a simmer and leave to bubble away gently for 10 mins or until the potatoes are cooked. Use a fork to crush a few of the potato chunks against the side of the pan to help thicken – you still want lots of defined chunks though. Stir through the clam meat and the few clam shells, if you've gone down that route, and simmer for a minute to reheat. Season with plenty of black pepper and a little salt, if needed, then stir through the parsley just before ladling into bowls or hollowed-out crusty rolls.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/rvtvuw1511190488.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=fEN_fm6kX6k",
      "mealPreparationTime": "50 minutes",
      "date": "2023-11-30",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "f195",
      "idMeal": "53035",
      "strMeal": "Ham hock colcannon",
      "strCategory": "Pork",
      "strArea": "Irish",
      "strInstructions": "STEP 1\r\nPeel and cut the potatoes into even, medium-sized chunks. Put in a large pan filled with cold salted water, bring to the boil and cook for 10-15 mins until a knife can be inserted into the potatoes easily.\r\n\r\nSTEP 2\r\nMeanwhile, melt the butter in a large sauté pan over a medium heat. Add the garlic, cabbage, spring onions and some seasoning. Stir occasionally until the cabbage is wilted but still retains a little bite, then set aside.\r\n\r\nSTEP 3\r\nDrain the potatoes, leave to steam-dry for a couple of mins, then mash with the cream, mustard and seasoning in the same saucepan. Stir in the cabbage and ham hock. Keep warm over a low heat.\r\n\r\nSTEP 4\r\nReheat the pan you used to cook the cabbage (no need to wash first), add a splash of oil, crack in the eggs and fry to your liking. To serve, divide the colcannon between bowls and top each with a fried egg.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/n41ny81608588066.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=aQJAU2iJ730",
      "mealPreparationTime": "3 hours",
      "date": "2024-02-29",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "6399",
      "idMeal": "52818",
      "strMeal": "Chicken Fajita Mac and Cheese",
      "strCategory": "Chicken",
      "strArea": "American",
      "strInstructions": "Fry your onion, peppers and garlic in olive oil until nicely translucent. Make a well in your veg and add your chicken. Add your seasoning and salt. Allow to colour slightly.\r\nAdd your cream, stock and macaroni.\r\nCook on low for 20 minutes. Add your cheeses, stir to combine.\r\nTop with roasted peppers and parsley.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/qrqywr1503066605.jpg",
      "strTags": "Pasta,Cheasy,Meat",
      "strYoutube": "https://www.youtube.com/watch?v=bwTSmLTZKNg",
      "mealPreparationTime": "45 minutes",
      "date": "2024-01-01",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "c6ed",
      "idMeal": "52811",
      "strMeal": "Ribollita",
      "strCategory": "Vegetarian",
      "strArea": "Italian",
      "strInstructions": "Put 2 tablespoons of the oil in a large pot over medium heat. When it’s hot, add onion, carrot, celery and garlic; sprinkle with salt and pepper and cook, stirring occasionally, until vegetables are soft, 5 to 10 minutes.\r\nHeat the oven to 500 degrees. Drain the beans; if they’re canned, rinse them as well. Add them to the pot along with tomatoes and their juices and stock, rosemary and thyme. Bring to a boil, then reduce heat so the soup bubbles steadily; cover and cook, stirring once or twice to break up the tomatoes, until the flavors meld, 15 to 20 minutes.\r\nFish out and discard rosemary and thyme stems, if you like, and stir in kale. Taste and adjust seasoning. Lay bread slices on top of the stew so they cover the top and overlap as little as possible. Scatter red onion slices over the top, drizzle with the remaining 3 tablespoons oil and sprinkle with Parmesan.\r\nPut the pot in the oven and bake until the bread, onions and cheese are browned and crisp, 10 to 15 minutes. (If your pot fits under the broiler, you can also brown the top there.) Divide the soup and bread among 4 bowls and serve.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/xrrwpx1487347049.jpg",
      "strTags": "Vegetarian",
      "strYoutube": "https://www.youtube.com/watch?v=BiQUYTBb6eQ",
      "mealPreparationTime": "2 hours",
      "date": "2023-05-20",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "89f9",
      "idMeal": "52848",
      "strMeal": "Bean & Sausage Hotpot",
      "strCategory": "Miscellaneous",
      "strArea": "British",
      "strInstructions": "In a large casserole, fry the sausages until brown all over – about 10 mins.\r\n\r\nAdd the tomato sauce, stirring well, then stir in the beans, treacle or sugar and mustard. Bring to the simmer, cover and cook for 30 mins. Great served with crusty bread or rice.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/vxuyrx1511302687.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=B0YX0yPX4Wo",
      "mealPreparationTime": "50 minutes",
      "date": "2022-09-13",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "0f7c",
      "idMeal": "53057",
      "strMeal": "Traditional Croatian Goulash",
      "strCategory": "Beef",
      "strArea": "Croatian",
      "strInstructions": "Clean the meat from the veins if there are some and cut it into smaller pieces, 3 × 3 cm. Marinate the meat in the mustard and spices and let it sit in the refrigerator for one hour\r\nHeat one tablespoon of pork fat or vegetable oil in a pot and fry the meat on all sides until it gets browned. Once the meat is cooked, transfer it to a plate and add another tablespoon of fat to the pot\r\nCut the onions very fine, peel the carrots and shred it using a grater. Cook the onions and carrots over low heat for 15 minutes. You can salt the vegetables a little to make them soften faster\r\nOnce the vegetables have browned and become slightly mushy, add the meat and bay leaves and garlic. Pour over with wine and simmer for 10-15 minutes to allow the alcohol to evaporate. Now is the right time to add 2/3 the amount of liquid\r\nCover the pot and cook over low heat for an hour, stirring occasionally. After the first hour, pour over the rest of the water or stock and cook for another 30-45 minutes\r\nAllow the stew to cool slightly and serve it with a sprinkle of chopped parsley and few slices of fresh hot pepper if you like to spice it up a bit\r\nSlice ​​some fresh bread, season the salad and simply enjoying these wonderful flavors",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/n1hcou1628770088.jpg",
      "strTags": "Soup",
      "strYoutube": "https://www.youtube.com/watch?v=ipEz5u2T7KM",
      "mealPreparationTime": "2 hours",
      "date": "2022-04-14",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "95d4",
      "idMeal": "52785",
      "strMeal": "Dal fry",
      "strCategory": "Vegetarian",
      "strArea": "Indian",
      "strInstructions": "Wash and soak toor dal in approx. 3 cups of water, for at least one hours. Dal will be double in volume after soaking. Drain the water.\r\nCook dal with 2-1/2 cups water and add salt, turmeric, on medium high heat, until soft in texture (approximately 30 mins) it should be like thick soup.\r\nIn a frying pan, heat the ghee. Add cumin seeds, and mustard seeds. After the seeds crack, add bay leaves, green chili, ginger and chili powder. Stir for a few seconds.\r\nAdd tomatoes, salt and sugar stir and cook until tomatoes are tender and mushy.\r\nAdd cilantro and garam masala cook for about one minute.\r\nPour the seasoning over dal mix it well and cook for another minute.\r\nServe with Naan.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/wuxrtu1483564410.jpg",
      "strTags": "Curry,Vegetarian,Cake",
      "strYoutube": "https://www.youtube.com/watch?v=J4D855Q9-jg",
      "mealPreparationTime": "1 hour",
      "date": "2023-02-21",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "c90e",
      "idMeal": "52993",
      "strMeal": "Honey Balsamic Chicken & Crispy Veggies",
      "strCategory": "Chicken",
      "strArea": "American",
      "strInstructions": "2 Servings\r\n\r\n1. Preheat oven to 425 degrees. Wash and dry all produce. Cut potatoes into 1/2-inch-thick wedges. Toss on one side of a baking sheet with a drizzle of oil, salt, and pepper. (For 4 servings, spread potatoes out across entire sheet.) Roast on top rack for 5 minutes (we'll add the broccoli then). \r\n\r\n2. Meanwhile, cut broccoli florets into bite-size pieces, if necessary. Peel and finely chop garlic. In a small microwave-safe bowl, combine 1 TBSP olive oil (2 TBSP for 4 servings) and half the garlic. Microwave until garlic sizzles, 30 seconds. \r\n\r\n3. Once potatoes have roasted 5 minutes, remove sheet from oven and add broccoli to empty side; carefully toss with garlic oil, salt, and pepper. (For 4 servings, add broccoli to a second sheet.) Continue roasting until potatoes and broccoli are browned and crispy, 15-20 minutes more. \r\n\r\n4. While veggies roast, pat chicken dry with paper towels; season all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. (If chicken browns too quickly, reduce heat to medium.) Turn off heat; set chicken aside to rest. Wash out pan. \r\n\r\n5. Heat pan used for chicken over medium-high heat. Add a drizzle of oil and remaining garlic; cook until fragrant, 30 seconds. Stir in vinegar, honey, stock concentrate, and 1/4 cup water (1/3 cup for 4 servings). Simmer until thick and glossy, 2-3 minutes. Remove from heat and stir in 1 TBSP butter (2 TBSP for 4). Season with salt and pepper. \r\n\r\n6. Return chicken to pan and turn to coat in glaze. Divide chicken, broccoli, and potatoes between plates. Spoon any remaining glaze over chicken and serve. ",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/kvbotn1581012881.jpg",
      "strTags": null,
      "strYoutube": "",
      "mealPreparationTime": "45 minutes",
      "date": "2022-02-22",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "97c7",
      "idMeal": "52858",
      "strMeal": "New York cheesecake",
      "strCategory": "Dessert",
      "strArea": "American",
      "strInstructions": "Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium pan. Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling.\r\nFor the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a table top mixer fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice.\r\nSwap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy.\r\nBrush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools.\r\nCombine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight.\r\nRun a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/swttys1511385853.jpg",
      "strTags": "Desert,Dairy,Pudding,Cake,Breakfast",
      "strYoutube": "https://www.youtube.com/watch?v=tspdJ6hxqnc",
      "mealPreparationTime": "5 hours",
      "date": "2022-05-03",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "653d",
      "idMeal": "53041",
      "strMeal": "Grilled Portuguese sardines",
      "strCategory": "Seafood",
      "strArea": "Portuguese",
      "strInstructions": "STEP 1\r\n\r\nPut all of the ingredients, except the sardines, into a bowl and mix together with some seasoning. Pour into a baking dish, add the sardines and toss really well. Cover and chill for a few hours.\r\n\r\nSTEP 2\r\n\r\nHeat a BBQ or griddle pan until hot. Cook the sardines for 4-5 minutes on each side or until really caramelised and charred. Put onto a serving plate, drizzle with oil, sprinkle with a little more paprika and squeeze over the lemon wedges.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/lpd4wy1614347943.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=JYtMjKa6cdY",
      "mealPreparationTime": "30 minutes",
      "date": "2023-06-14",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "7c10",
      "idMeal": "53083",
      "strMeal": "Lamb Pilaf (Plov)",
      "strCategory": "Lamb",
      "strArea": "Russian",
      "strInstructions": "Place the raisins and prunes into a small bowl and pour over enough water to cover. Add lemon juice and let soak for at least 1 hour. Drain. Roughly chop the prunes.\r\n\r\nMeanwhile, heat the butter in a large pan, add the onion, and cook for 5 minutes. Add cubed lamb, ground lamb, and crushed garlic cloves. Fry for 5 minutes, stirring constantly until browned.\r\n\r\nPour 2/3 cup (150 milliliters) of stock into the pan. Bring to a boil, then lower the heat, cover, and simmer for 1 hour, or until the lamb is tender.\r\n\r\nAdd the remaining stock and bring to a boil. Add rinsed long-grain white rice and a large pinch of saffron. Stir, then cover, and simmer for 15 minutes, or until the rice is tender.\r\n\r\nAdd the drained raisins, drained chopped prunes, and salt and pepper to taste. Heat through for a few minutes, then turn out onto a warmed serving dish and garnish with sprigs of flat-leaf parsley.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/kos9av1699014767.jpg",
      "strTags": "rice",
      "strYoutube": "https://www.youtube.com/watch?v=rllQsUw1hFQ",
      "mealPreparationTime": "1 hours",
      "date": "2023-07-21",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "d572",
      "idMeal": "52932",
      "strMeal": "Pouding chomeur",
      "strCategory": "Dessert",
      "strArea": "Canadian",
      "strInstructions": "In a large bowl, with an electric mixer, mix the butter and sugar till the mix is light.\r\nAdd eggs and vanilla and mix.\r\nIn another bowl, mix flour and baking powder.\r\nAlternate flour mix and milk to the butter mix.\r\nPour into a 13 inch by 9 inch greased pan.\r\nMAPLE SAUCE.\r\nIn a large casserole, bring to boil the syrup, brown sugar, cream and butter and constantly stir.\r\nReduce heat and and gently cook 2 minutes or till sauce has reduced a little bit.\r\nPour sauce gently over cake.\r\nBake at 325°f (160°c) about 35 minutes or till cake is light brown and when toothpick inserted comes out clean.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg",
      "strTags": "Pudding",
      "strYoutube": "https://www.youtube.com/watch?v=WFvj71RZYPc",
      "mealPreparationTime": "45 minutes",
      "date": "2024-01-11",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "8673",
      "idMeal": "52982",
      "strMeal": "Spaghetti alla Carbonara",
      "strCategory": "Pasta",
      "strArea": "Italian",
      "strInstructions": "STEP 1\r\nPut a large saucepan of water on to boil.\r\n\r\nSTEP 2\r\nFinely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.\r\n\r\nSTEP 3\r\nBeat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.\r\n\r\nSTEP 4\r\nAdd 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).\r\n\r\nSTEP 5\r\nSquash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.\r\n\r\nSTEP 6\r\nWhile the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.\r\n\r\nSTEP 7\r\nLeave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.\r\n\r\nSTEP 8\r\nKeep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet.\r\n\r\nSTEP 9\r\nMix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.\r\n\r\nSTEP 10\r\nTake the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated.\r\n\r\nSTEP 11\r\nAdd extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed.\r\n\r\nSTEP 12\r\nUse a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a guse of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/llcbn01574260722.jpg",
      "strTags": "Pasta,BBQ,Breakfast",
      "strYoutube": "https://www.youtube.com/watch?v=_T6jkRvhlkk",
      "mealPreparationTime": "30 minutes",
      "date": "2024-03-21",
      "isFavorited": true,
      "userFeedback": [
        {
          "name": "test",
          "rating": 5,
          "comment": "test"
        },
        {
          "name": "Kuk Hoon",
          "date": "2024-03-27",
          "rating": 5,
          "comment": "nice!"
        }
      ]
    },
    {
      "id": "aa5d",
      "idMeal": "53032",
      "strMeal": "Tonkatsu pork",
      "strCategory": "Pork",
      "strArea": "Japanese",
      "strInstructions": "STEP 1\r\nRemove the large piece of fat on the edge of each pork loin, then bash each of the loins between two pieces of baking parchment until around 1cm in thickness – you can do this using a meat tenderiser or a rolling pin. Once bashed, use your hands to reshape the meat to its original shape and thickness – this step will ensure the meat is as succulent as possible.\r\n\r\nSTEP 2\r\nPut the flour, eggs and panko breadcrumbs into three separate wide-rimmed bowls. Season the meat, then dip first in the flour, followed by the eggs, then the breadcrumbs.\r\n\r\nSTEP 3\r\nIn a large frying or sauté pan, add enough oil to come 2cm up the side of the pan. Heat the oil to 180C – if you don’t have a thermometer, drop a bit of panko into the oil and if it sinks a little then starts to fry, the oil is ready. Add two pork chops and cook for 1 min 30 secs on each side, then remove and leave to rest on a wire rack for 5 mins. Repeat with the remaining pork chops.\r\n\r\nSTEP 4\r\nWhile the pork is resting, make the sauce by whisking the ingredients together, adding a splash of water if it’s particularly thick. Slice the tonkatsu and serve drizzled with the sauce.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/lwsnkl1604181187.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=aASr5x0d3Ys",
      "mealPreparationTime": "30 minutes",
      "date": "2023-01-25",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "2207",
      "idMeal": "52976",
      "strMeal": "Cashew Ghoriba Biscuits",
      "strCategory": "Dessert",
      "strArea": "Tunisian",
      "strInstructions": "Preheat the oven at 180 C / Gas 4. Line a baking tray with greaseproof paper.\r\nIn a bowl, mix the cashews and icing sugar. Add the egg yolks and orange blossom water and mix to a smooth homogeneous paste.\r\nTake lumps of the cashew paste and shape into small balls. Roll the balls in icing sugar and transfer to the baking tray. Push an almond in the centre of each ghribia.\r\nBake until the biscuits are lightly golden, about 20 minutes. Keep an eye on them, they burn quickly.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/t3r3ka1560461972.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=IqXEZUk4hWI",
      "mealPreparationTime": "30 minutes",
      "date": "2023-10-21",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "7297",
      "idMeal": "52812",
      "strMeal": "Beef Brisket Pot Roast",
      "strCategory": "Beef",
      "strArea": "American",
      "strInstructions": "1 Prepare the brisket for cooking: On one side of the brisket there should be a layer of fat, which you want. If there are any large chunks of fat, cut them off and discard them. Large pieces of fat will not be able to render out completely.\r\nUsing a sharp knife, score the fat in parallel lines, about 3/4-inch apart. Slice through the fat, not the beef. Repeat in the opposite direction to make a cross-hatch pattern.\r\nSalt the brisket well and let it sit at room temperature for 30 minutes.\r\n \r\n2 Sear the brisket: You'll need an oven-proof, thick-bottomed pot with a cover, or Dutch oven, that is just wide enough to hold the brisket roast with a little room for the onions.\r\nPat the brisket dry and place it, fatty side down, into the pot and place it on medium high heat. Cook for 5-8 minutes, lightly sizzling, until the fat side is nicely browned. (If the roast seems to be cooking too fast, turn the heat down to medium. You want a steady sizzle, not a raging sear.)\r\nTurn the brisket over and cook for a few minutes more to brown the other side.\r\n\r\n3 Sauté the onions and garlic: When the brisket has browned, remove it from the pot and set aside. There should be a couple tablespoons of fat rendered in the pot, if not, add some olive oil.\r\nAdd the chopped onions and increase the heat to high. Sprinkle a little salt on the onions. Sauté, stirring often, until the onions are lightly browned, 5-8 minutes. Stir in the garlic and cook 1-2 more minutes.\r\n \r\n4 Return brisket to pot, add herbs, stock, bring to simmer, cover, cook in oven: Preheat the oven to 300°F. Use kitchen twine to tie together the bay leaves, rosemary and thyme.\r\nMove the onions and garlic to the sides of the pot and nestle the brisket inside. Add the beef stock and the tied-up herbs. Bring the stock to a boil on the stovetop.\r\nCover the pot, place the pot in the 300°F oven and cook for 3 hours. Carefully flip the brisket every hour so it cooks evenly.\r\n \r\n5 Add carrots, continue to cook: After 3 hours, add the carrots. Cover the pot and cook for 1 hour more, or until the carrots are cooked through and the brisket is falling-apart tender.\r\n6 Remove brisket to cutting board, tent with foil: When the brisket is falling-apart tender, take the pot out of the oven and remove the brisket to a cutting board. Cover it with foil. Pull out and discard the herbs.\r\n7 Make sauce (optional): At this point you have two options. You can serve as is, or you can make a sauce with the drippings and some of the onions. If you serve as is, skip this step.\r\nTo make a sauce, remove the carrots and half of the onions, set aside and cover them with foil. Pour the ingredients that are remaining into the pot into a blender, and purée until smooth. If you want, add 1 tablespoon of mustard to the mix. Put into a small pot and keep warm.\r\n8 Slice the meat across the grain: Notice the lines of the muscle fibers of the roast. This is the \"grain\" of the meat. Slice the meat perpendicular to these lines, or across the grain (cutting this way further tenderizes the meat), in 1/4-inch to 1/2-inch slices.\r\nServe with the onions, carrots and gravy. Serve with mashed, roasted or boiled potatoes, egg noodles or polenta.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/ursuup1487348423.jpg",
      "strTags": "Meat",
      "strYoutube": "https://www.youtube.com/watch?v=gh48wM6bPWQ",
      "mealPreparationTime": "4 hours",
      "date": "2024-01-10",
      "isFavorited": false,
      "userFeedback": [
        {
          "name": "Chris",
          "rating": 5,
          "comment": "test"
        },
        {
          "name": "test 2",
          "rating": 1,
          "comment": "test 2"
        }
      ]
    },
    {
      "id": "4332",
      "idMeal": "52796",
      "strMeal": "Chicken Alfredo Primavera",
      "strCategory": "Chicken",
      "strArea": "Italian",
      "strInstructions": "Heat 1 tablespoon of butter and 2 tablespoons of olive oil in a large skillet over medium-high heat. Season both sides of each chicken breast with seasoned salt and a pinch of pepper. Add the chicken to the skillet and cook for 5-7 minutes on each side, or until cooked through.  While the chicken is cooking, bring a large pot of water to a boil. Season the boiling water with a few generous pinches of kosher salt. Add the pasta and give it a stir. Cook, stirring occasionally, until al dente, about 12 minutes. Reserve 1/2 cup of  pasta water before draining the pasta.  Remove the chicken from the pan and transfer it to a cutting board; allow it to rest. Turn the heat down to medium and dd the remaining 1 tablespoon of butter and olive oil to the same pan you used to cook the chicken. Add the veggies (minus the garlic) and red pepper flakes to the pan and stir to coat with the oil and butter (refrain from seasoning with salt until the veggies are finished browning). Cook, stirring often, until the veggies are tender, about 5 minutes. Add the garlic and a generous pinch of salt and pepper to the pan and cook for 1 minute.  Deglaze the pan with the white wine. Continue to cook until the wine has reduced by half, about 3 minutes. Stir in the milk, heavy cream, and reserved pasta water. Bring the mixture to a gentle boil and allow to simmer and reduce for 2-3 minutes. Turn off the heat and add the Parmesan cheese and cooked pasta. Season with salt and pepper to taste. Garnish with Parmesan cheese and chopped parsley, if desired. ",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/syqypv1486981727.jpg",
      "strTags": "Pasta,Meat,Dairy",
      "strYoutube": "https://www.youtube.com/watch?v=qCIbq8HywpQ",
      "mealPreparationTime": "45 minutes",
      "date": "2023-12-16",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "8135",
      "idMeal": "53072",
      "strMeal": "Crispy Eggplant",
      "strCategory": "Vegetarian",
      "strArea": "Filipino",
      "strInstructions": "Slice eggplant into 1 cm (0.4-inch) slices. Place them in a bowl and sprinkle them with salt. allow them to sit for 30 minutes to render some of their liquid and bitterness.\r\n2. After 30 minutes wash eggplant slices from salt and pat dry with a kitchen towel.\r\n3. In a large bowl/plate place breadcrumbs and sesame seeds. In another bowl beat 2 eggs with pinch salt and pepper.\r\n4. Heal oil in a large skillet over high heat.\r\n5. Dip eggplant slices in egg, then in crumbs, and place in hot oil. Fry 2 to 3 minutes on each side, or until golden brown. Drain on a paper towel. \r\n",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/c7lzrl1683208757.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=4mINk5d2hto",
      "mealPreparationTime": "1 hour",
      "date": "2021-12-26",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "386e",
      "idMeal": "53052",
      "strMeal": "Roti john",
      "strCategory": "Beef",
      "strArea": "Malaysian",
      "strInstructions": "Mix all the ingredients in a bowl.\r\nHeat a pan or griddle with a little vegetable oil.\r\nPour the mixture onto the pan and place a piece of open-faced baguette on top.\r\nPress on the bread with a spatula and grill for 2 minutes.\r\nTurn the bread over to make it a little crispy.\r\nRemove from pan and cut the bread into small portions.\r\nAdd mayonnaise and/or Sambal before cutting the sandwich (optional).",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/hx335q1619789561.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=cl4YH8wblRs",
      "mealPreparationTime": "30 minutes",
      "date": "2022-01-29",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "8acc",
      "idMeal": "53040",
      "strMeal": "Spring onion and prawn empanadas",
      "strCategory": "Seafood",
      "strArea": "Portuguese",
      "strInstructions": "STEP 1\r\n\r\nTo make the dough, rub the butter into the flour and then add the egg white and half the yolk (keep the rest), vinegar, a pinch of salt and enough cold water to make a soft dough. Knead on a floured surface until smooth and then wrap and rest for 30 minutes.\r\n\r\nSTEP 2\r\n\r\nHeat the oven to 180c/fan 160c/gas 4. Trim the green ends of the spring onions and then finely slice the rest. Heat a little oil in a pan and fry them gently until soft but not browned. Add the chilli and garlic, stir and then add the prawns and cook until they are opaque. Season well. Scoop out the prawns and bubble the juices until they thicken, then add back the prawns.\r\n\r\nSTEP 3\r\n\r\nDivide the empanada dough into eight balls and roll out to thin circles on a floured surface. Put some filling on one half of the dough, sprinkle the feta on top and fold the other half over. Trim the edge and then fold and crimp the dough together so the empanada is tightly sealed, put it on an oiled baking sheet either on its side or sitting on its un-crimped edge like a cornish pasty. Repeat with the remaining dough and mixture. Mix the leftover egg yolk with a splash of water and brush the top of the empanadas.\r\n\r\nSTEP 4\r\n\r\nBake for 30 minutes or until golden and slightly crisp around the edges.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/1c5oso1614347493.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=Q24haJU-1dI",
      "mealPreparationTime": "1 hour",
      "date": "2023-10-25",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "a349",
      "idMeal": "52862",
      "strMeal": "Peach & Blueberry Grunt",
      "strCategory": "Dessert",
      "strArea": "American",
      "strInstructions": "Heat oven to 190C/170C fan/gas 5. Butter a wide shallow ovenproof dish. Blend the cornflour with the orange zest and juice, and put in a large pan with the sugar. Halve, stone and slice the peaches and add to the pan. Bring slowly to the boil, stirring gently until the sauce is shiny and thickened, about 3-4 mins. Remove from the heat, stir in the blueberries and tip into the prepared dish.\r\nTip the flour into a mixing bowl and add the 50g butter. Rub the butter into the flour until it resembles fine breadcrumbs, then stir in half the sugar. Mix the remaining sugar with the cinnamon and set aside.\r\nAdd the milk to the dry ingredients and mix to a soft dough. Turn out onto a lightly floured surface and knead briefly. Roll out to an oblong roughly 16 x 24cm. Brush with melted butter and sprinkle evenly with the spicy sugar. Roll up from one long side and cut into 12 slices. Arrange around the top of the dish, leaving the centre uncovered.\r\nBake for 20-25 mins, until the topping is crisp and golden. Serve warm.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/ssxvup1511387476.jpg",
      "strTags": "Desert,Pudding,Fruity",
      "strYoutube": "https://www.youtube.com/watch?v=SNeO28BCpsc",
      "mealPreparationTime": "1 hour",
      "date": "2024-03-22",
      "isFavorited": true,
      "userFeedback": [
        {
          "name": "test",
          "rating": 1,
          "comment": "test"
        },
        {
          "name": "test 2",
          "rating": 3,
          "comment": "test 2"
        }
      ]
    },
    {
      "id": "23aa",
      "idMeal": "52877",
      "strMeal": "Lamb and Potato pie",
      "strCategory": "Lamb",
      "strArea": "British",
      "strInstructions": "Dust the meat with flour to lightly coat.\r\nHeat enough vegetable oil in a large saucepan to fill the base, and fry the onion and meat until lightly browned. Season with salt and pepper.\r\nAdd the carrots, stock and more seasoning to taste.\r\nBring to the boil, cover and reduce the heat to a simmer. Simmer for at least an hour or until the meat is tender. Take your time cooking the meat, the longer you leave it to cook, the better the flavour will be.\r\nPreheat the oven to 180C/350F/Gas 4.\r\nAdd the drained potato cubes to the lamb.\r\nTurn the mixture into a pie dish or casserole and cover with the shortcrust pastry. Make three slits in the top of the pastry to release any steam while cooking.\r\nBrush with beaten egg and bake for about 40 minutes, until the pastry is golden brown.\r\nServe.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/sxrpws1511555907.jpg",
      "strTags": "Pie",
      "strYoutube": "https://www.youtube.com/watch?v=NCyPaaUNYUk",
      "mealPreparationTime": "2 hours",
      "date": "2023-04-22",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "2dc0",
      "idMeal": "52944",
      "strMeal": "Escovitch Fish",
      "strCategory": "Seafood",
      "strArea": "Jamaican",
      "strInstructions": "Rinse fish; rub with lemon or lime, seasoned with salt and pepper or use your favorite seasoning. I used creole seasoning. Set aside or place in the oven to keep it warm until sauce is ready.\r\n\r\nIn large skillet heat oil over medium heat, until hot, add the fish, cook each side- for about 5-7 minutes until cooked through and crispy on both sides. Remove fish and set aside. Drain oil and leave about 2-3 tablespoons of oil\r\nAdd, bay leave, garlic and ginger, stir-fry for about a minute making sure the garlic does not burn\r\nThen add onion, bell peppers, thyme, scotch bonnet, sugar, all spice-continue stirring for about 2-3 minutes. Add vinegar, mix an adjust salt and pepper according to preference. Let it simmer for about 2 more minutes. \r\n\r\nDiscard bay leave, thyme spring and serve over fish with a side of this bammy. You may make the sauce about 2 days in advance.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/1520084413.jpg",
      "strTags": "Seafood,Spicy,Speciality,Easter",
      "strYoutube": "https://www.youtube.com/watch?v=nF6DOtGE6k8",
      "mealPreparationTime": "30 minutes",
      "date": "2023-09-22",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "6886",
      "idMeal": "52981",
      "strMeal": "Snert (Dutch Split Pea Soup)",
      "strCategory": "Side",
      "strArea": "Dutch",
      "strInstructions": "Gather the ingredients.\r\n\r\nIn a large soup pot, bring water, split peas, pork belly or bacon, pork chop, and bouillon cube to a boil. Reduce the heat to a simmer, cover and let cook for 45 minutes, stirring occasionally and skimming off any foam that rises to the top. \r\n\r\nRemove the pork chop, debone, and thinly slice the meat. Set aside.\r\n\r\nAdd the celery, carrots, potato, onion, leek, and celeriac to the soup. Return to the boil, reduce the heat to a simmer and let cook, uncovered, for another 30 minutes, adding a little extra water if the ingredients start to stick to the bottom of the pot.\r\n\r\nAdd the smoked sausage for the last 15 minutes of cooking time. When the vegetables are tender, remove the bacon and smoked sausage, slice thinly and set aside.\r\n\r\nIf you prefer a smooth consistency, purée the soup with a stick blender. Season to taste with salt and pepper. Add the meat back to the soup, setting some slices of rookworst aside.\r\n\r\nServe in heated bowls or soup plates, garnished with slices of rookworst and chopped celery leaf.\r\n\r\nEnjoy!",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/9ptx0a1565090843.jpg",
      "strTags": "Soup,Cake",
      "strYoutube": "https://www.youtube.com/watch?v=5YV0sJLtLt8",
      "mealPreparationTime": "2 hours",
      "date": "2022-03-13",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "308e",
      "idMeal": "52972",
      "strMeal": "Tunisian Lamb Soup",
      "strCategory": "Lamb",
      "strArea": "Tunisian",
      "strInstructions": "Add the lamb to a casserole and cook over high heat. When browned, remove from the heat and set aside.\r\nKeep a tablespoon of fat in the casserole and discard the rest. Reduce to medium heat then add the garlic, onion and spinach and cook until the onion is translucent and the spinach wilted or about 5 minutes.\r\nReturn the lamb to the casserole with the onion-spinach mixture, add the tomato puree, cumin, harissa, chicken, chickpeas, lemon juice, salt and pepper in the pan. Simmer over low heat for about 20 minutes.\r\nAdd the pasta and cook for 15 minutes or until pasta is cooked.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/t8mn9g1560460231.jpg",
      "strTags": "Soup",
      "strYoutube": "https://www.youtube.com/watch?v=w1qgTQmLRe4",
      "mealPreparationTime": "1 hour",
      "date": "2022-03-12",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "8f7d",
      "idMeal": "53053",
      "strMeal": "Beef Rendang",
      "strCategory": "Beef",
      "strArea": "Malaysian",
      "strInstructions": "Chop the spice paste ingredients and then blend it in a food processor until fine.\r\nHeat the oil in a stew pot, add the spice paste, cinnamon, cloves, star anise, and cardamom and stir-fry until aromatic. Add the beef and the pounded lemongrass and stir for 1 minute. Add the coconut milk, tamarind juice, water, and simmer on medium heat, stirring frequently until the meat is almost cooked. Add the kaffir lime leaves, kerisik (toasted coconut), sugar or palm sugar, stirring to blend well with the meat.\r\nLower the heat to low, cover the lid, and simmer for 1 to 1 1/2 hours or until the meat is really tender and the gravy has dried up. Add more salt and sugar to taste. Serve immediately with steamed rice and save some for overnight.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/bc8v651619789840.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=Ot-dmfBaZrA",
      "mealPreparationTime": "3 hours",
      "date": "2023-01-22",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "160a",
      "idMeal": "53047",
      "strMeal": "Moroccan Carrot Soup",
      "strCategory": "Vegetarian",
      "strArea": "Moroccan",
      "strInstructions": "Step 1\r\nPreheat oven to 180° C.\r\nStep 2\r\nCombine carrots, onion, garlic, cumin seeds, coriander seeds, salt and olive oil in a bowl and mix well. Transfer on a baking tray.\r\nStep 3\r\nPut the baking tray in preheated oven and roast for 10-12 minutes or till carrots soften. Remove from heat and cool.\r\nStep 4\r\nGrind the baked carrot mixture along with some water to make a smooth paste and strain in a bowl.\r\nStep 5\r\nHeat the carrot mixture in a non-stick pan. Add two cups of water and bring to a boil. Add garam masala powder and mix. Add salt and mix well.\r\nStep 6\r\nRemove from heat, add lemon juice and mix well.\r\nStep 7\r\nServe hot.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/jcr46d1614763831.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=7tDWOpnIhok",
      "mealPreparationTime": "1 hour",
      "date": "2023-10-22",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "df7a",
      "idMeal": "53048",
      "strMeal": "Mee goreng mamak",
      "strCategory": "Seafood",
      "strArea": "Malaysian",
      "strInstructions": "Heat oil in a pan at medium heat. Then, add peanuts, dried chilies, dried shrimps and dhal. Fry the aromatics until fragrant. Remove from pan and leave aside.\r\n\r\nBlend fried ingredients with tamarind paste and water until fine. Then, sauté the blended ingredients in oil heated over low heat. Continue cooking until the oil separates from the paste and turns a darker shade.\r\n\r\nSkin and cut potatoes into small chunks and boil them in a pot of water until knife-tender. Once ready, remove them from the pot and leave aside. Discard water.\r\n\r\nSlice onion and fried tofu, mince garlic, cut some cabbage and Chinese flowering cabbage (choi sam). Prepare prawn fritters and cut them. Boil noodles to soften them if bought dried. Also mix black soy sauce with water.\r\n\r\nTo fry one portion of mee goreng mamak, heat oil and add 1/4 of the following ingredients in this order: garlic, onion, paste. Sauté until fragrant. Optionally, add prawns.\r\n\r\nAdd in 1/4 amount of tofu, boiled potatoes, cabbage, Chinese flowering cabbage and prawn fritters. Sauté for another 30 seconds.\r\n\r\nAdd noodles to the wok. Add 3 tablespoons of dark soy sauce mixture. Mix evenly for the next 1 minute. Then, move the noodles to the side of the wok. Stir in an egg. Garnish with a slice of lime and slices of green chilies. To cook another plate of noodles, repeat from step 5 onwards.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/xquakq1619787532.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=pOJEmDBgtSk",
      "mealPreparationTime": "1 hour",
      "date": "2024-03-25",
      "isFavorited": true,
      "userFeedback": [
        {
          "name": "test",
          "rating": 5,
          "comment": "test"
        },
        {
          "name": "test",
          "rating": 1,
          "comment": "test"
        },
        {
          "name": "Rita",
          "rating": 5,
          "comment": "YUM"
        }
      ]
    },
    {
      "id": "8ded",
      "idMeal": "52998",
      "strMeal": "Corned Beef and Cabbage",
      "strCategory": "Beef",
      "strArea": "Irish",
      "strInstructions": "1\r\n\r\nPlace corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef. Cover pot and bring to a boil, then reduce to a simmer. Simmer approximately 50 minutes per pound or until tender.\r\n\r\n2\r\n\r\nAdd whole potatoes and peeled and cut carrots, and cook until the vegetables are almost tender. Add cabbage and cook for 15 more minutes. Remove meat and let rest 15 minutes.\r\n\r\n3\r\n\r\nPlace vegetables in a bowl and cover. Add as much broth (cooking liquid reserved in the Dutch oven or large pot) as you want. Slice meat across the grain.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/xb97a81583266727.jpg",
      "strTags": "",
      "strYoutube": "",
      "mealPreparationTime": "3 hours",
      "date": "2023-04-22",
      "isFavorited": false,
      "userFeedback": []
    },
    {
      "id": "e304",
      "idMeal": "52853",
      "strMeal": "Chocolate Avocado Mousse",
      "strCategory": "Dessert",
      "strArea": "British",
      "strInstructions": "1. Blend all the mousse ingredients together in your food processor until smooth. Add the cacao powder first and, as you blend, have all the ingredients to hand in order to adjust the ratios slightly as the size of avocados and bananas varies so much. The perfect ratio in order to avoid the dish tasting too much of either is to use equal amounts of both.\r\n\r\n2. Taste and add a few drops of stevia if you feel you need more sweetness.\r\n\r\n3. Fill little cups or shot glasses with the mousse, sprinkle with the cacao powder or nibs and serve.\r\n\r\nTip If you don’t have a frozen banana to hand you can just use a normal one and then chill the mousse before serving for a cooling dessert.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/uttuxy1511382180.jpg",
      "strTags": null,
      "strYoutube": "https://www.youtube.com/watch?v=wuZffe60q4M",
      "mealPreparationTime": "1 hour",
      "date": "2023-12-22",
      "isFavorited": false,
      "userFeedback": []
    }
  ]
}